<a href="https://colab.research.google.com/github/ajnasaju3/ai/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import files
upload=files.upload()

Saving nyc_weather.csv to nyc_weather.csv

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_csv('nyc_weather.csv')
df

          EST  Temperature  DewPoint  ...  CloudCover    Events  WindDirDegrees
0    1/1/2016           38        23  ...           5       NaN             281
1    1/2/2016           36        18  ...           3       NaN             275
2    1/3/2016           40        21  ...           1       NaN             277
3    1/4/2016           25         9  ...           3       NaN             345
4    1/5/2016           20        -3  ...           0       NaN             333
5    1/6/2016           33         4  ...           0       NaN             259
6    1/7/2016           39        11  ...           3       NaN             293
7    1/8/2016           39        29  ...           8       NaN              79
8    1/9/2016           44        38  ...           8      Rain              76
9   1/10/2016           50        46  ...           7      Rain             109
10  1/11/2016           33         8  ...           1       NaN             289
11  1/12/2016           35        15  ...           4       NaN             235
12  1/13/2016           26         4  ...           0       NaN             284
13  1/14/2016           30        12  ...           7       NaN             266
14  1/15/2016           43        31  ...           2       NaN             101
15  1/16/2016           47        37  ...           7      Rain             340
16  1/17/2016           36        23  ...           6  Fog-Snow             345
17  1/18/2016           25         6  ...           2      Snow             293
18  1/19/2016           22         3  ...           1       NaN             293
19  1/20/2016           32        15  ...           2       NaN             302
20  1/21/2016           31        11  ...           1       NaN             312
21  1/22/2016           26         6  ...           3      Snow              34
22  1/23/2016           26        21  ...           8  Fog-Snow              42
23  1/24/2016           28        11  ...           3      Snow             327
24  1/25/2016           34        18  ...           2       NaN             286
25  1/26/2016           43        29  ...           2       NaN             244
26  1/27/2016           41        22  ...           3      Rain             311
27  1/28/2016           37        20  ...           1       NaN             234
28  1/29/2016           36        21  ...           4       NaN             298
29  1/30/2016           34        16  ...           0       NaN             257
30  1/31/2016           46        28  ...           0       NaN             241

[31 rows x 11 columns]

In [ ]:
df['EST'][df['Events']=="Rain"]

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [ ]:
df['WindSpeedMPH'].mean()

6.892857142857143

In [ ]:
df['EST'][df['Temperature']==df['Temperature'].max()]

9    1/10/2016
Name: EST, dtype: object

In [ ]:
df[df['Temperature']==df['Temperature'].max()]

         EST  Temperature  DewPoint  ...  CloudCover  Events  WindDirDegrees
9  1/10/2016           50        46  ...           7    Rain             109

[1 rows x 11 columns]

In [ ]:
df.EST[df.Temperature==df.Temperature.max()]

9    1/10/2016
Name: EST, dtype: object

In [ ]:
df.to_csv('new.csv')

In [ ]:
from google.colab import files
upload=files.upload()

Saving weather_data_cities.csv to weather_data_cities.csv

In [ ]:
df=pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [ ]:
g=df.groupby('city')

In [ ]:
for city,city_df in g:
  print(city)
  print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [ ]:
 g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [ ]:
  g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [ ]:
g.mean()

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [ ]:
g.describe()

         temperature                         ... windspeed
               count   mean       std   min  ...       25%   50%    75%   max
city                                         ...
mumbai           4.0  88.50  3.109126  85.0  ...      5.00   8.5  12.75  15.0
new york         4.0  32.25  3.304038  28.0  ...      6.75   7.0   8.25  12.0
paris            4.0  47.75  5.315073  42.0  ...      9.50  11.5  14.75  20.0

[3 rows x 16 columns]

In [ ]:
ind_data=pd.DataFrame({
    "Cities":['kerala','TN','chennail'],
    "temperature":[90,100,110],
    "name":['qwe','rty','asd']
})
ind_data

     Cities  temperature name
0    kerala           90  qwe
1        TN          100  rty
2  chennail          110  asd

In [ ]:
us_data=pd.DataFrame({
    "Cities":['new york','Los','Washington'],
    "temperature":[920,120,150],
    "name":['qwe','rty','asd']
})
us_data

       Cities  temperature name
0    new york          920  qwe
1         Los          120  rty
2  Washington          150  asd

In [ ]:
df=pd.concat([ind_data,us_data])

In [ ]:
df

       Cities  temperature name
0      kerala           90  qwe
1          TN          100  rty
2    chennail          110  asd
0    new york          920  qwe
1         Los          120  rty
2  Washington          150  asd

In [ ]:
df=pd.concat([ind_data,us_data],axis=1)

In [ ]:
df

     Cities  temperature name      Cities  temperature name
0    kerala           90  qwe    new york          920  qwe
1        TN          100  rty         Los          120  rty
2  chennail          110  asd  Washington          150  asd

In [ ]:
df=pd.concat([ind_data,us_data],ignore_index=True)

In [ ]:
df

       Cities  temperature name
0      kerala           90  qwe
1          TN          100  rty
2    chennail          110  asd
3    new york          920  qwe
4         Los          120  rty
5  Washington          150  asd

In [ ]:
ind_data=pd.DataFrame({
    "Cities":['kerala','TN','chennail'],
    "temperature":[90,100,110],
    "name":['qwe','rty','asd']
})
ind_data

     Cities  temperature name
0    kerala           90  qwe
1        TN          100  rty
2  chennail          110  asd

In [ ]:
more_data=pd.DataFrame({
    "Cities":['kerala','TN','chennail'],
    "people":[90,100,110],
})
more_data

     Cities  people
0    kerala      90
1        TN     100
2  chennail     110

In [ ]:
pd.merge(ind_data,more_data,on='Cities',how='right')

     Cities  temperature name  people
0    kerala           90  qwe      90
1        TN          100  rty     100
2  chennail          110  asd     110

In [41]:
s=pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[50,51,52,53,54,1,2,3,4,5])

In [42]:
s.loc[53]

0    4
Name: 53, dtype: int64

In [43]:
s.iloc[3]

0    4
Name: 53, dtype: int64

In [44]:
s.loc[:3]

    0
50  1
51  2
52  3
53  4
54  5
1   6
2   7
3   8

In [45]:
s.iloc[:3]

    0
50  1
51  2
52  3